# St7GetNumBXSLoopPoints

Returns the number of points contained in the specified loop in a BXS.

long St7GetNumBXSLoopPoints(long uID, long PropNum, long LoopNum,

long* NumPoints)

Input Parameters

uID

Strand7 model file ID.

PropNum

The BXS property number.

LoopNum

The loop number within the BXS.

Output Parameters
NumPoints

The number of points within LoopNum.

Strand7 API Manual